import React from "react";
import Brandtems from "./items";

export default function Companys() {
  const info = [
    {
      img: "adidas",
      title:
        "آدیداس یک هلدینگ است و شرکت تولید پوشاک ورزشی ریبوک، شرکت لوازم گلف تیلورمید و شرکت راک پورت زیرمجموعه‌های آن به‌شمار می‌آیند. آدیداس بزرگترین تولیدکننده لوازم ورزشی در اروپا و پس از نایکی دومین تولیدکننده بزرگ لوازم ورزشی در جهان می‌باشد.",
    },
    {
      img: "calvin",
      title:
        "برند کلوین کلین که بنام سی‌کی (CK) نیز شناخته می‌شود،یک برند آمریکایی می‌باشد، که توسط طراح مد، کلوین کلاین، تأسیس شده‌است.",
    },
    {
      img: "andy",
      title:
        "یک برند لباس آمریکایی هست.شروع این برند با تولید لباس های مردانه آغاز شد و سپس به تولید لباس کودکانه تغییر کرد.",
    },
    {
      img: "zara",
      title:
        "رند زارا (به انگلیسی: Zara ) یکی از بزرگترین برندهای پوشاک آقایان و بانوان است که در زمینه تولید محصولات و پوشاک مربوط به کودک و نوزاد از بدو تولد تا 14 سالگی نیز فعالیت می‌کند. این برند از سال 1975 در اسپانیا کار خود را با طراحی مدل‌های خاص شروع کرد. یکی از ویژگی‌های برند زارا، توجه همیشگی به محیط زیست و قابل بازیافت بودن محصولاتش است. برند زارا جزء برندهای لوکس لباس و لوازم شخصی محسوب می‌شود.",
    },
    {
      img: "skip",
      title:
        "مروزه Skip Hop یک برند جهانی برای والدین، نوزادان و کودکان نوپاست و محصولات این برند در 30 کشور دنیا در سراسر جهان به فروش می‌رسد. این برند درباره‌ی امنیت و کیفیت محصولاتش تعهد می‌دهد. محصولات Skip Hop از تست‌های بسیار دقیقی گذر می‌کنند تا بار نگرانی را از دوش والدین در هنگام تصمیم‌گیری بردارند.",
    },
    {
      img: "little",
      title:
        "این برند به طور مداوم در حال توسعه پوشاک نوآورانه، لوازم جانبی و محصولاتی است که مسیر پرورش کودکان را برای آن‌ها راحت‌تر و برای والدینشان جذاب‌تر سازد. این برند بر روی پارچه‌هایی مانند پنبه نرم، حوله‌ای و مخمل تمرکز می‌کند. و محصول کشور آمریکا می باشد.",
    },
    {
      img: "oshkosh",
      title:
        "برند اُش کُش بی گُش (به انگلیسی: Oshkosh B’Gosh)  یکی از تولیدکنندگان پوشاک بچه‌گانه آمریکایی است که در ویسکانسین تاسیس گردیده است. این برند در حال حاضر از برند‌های تابعه کمپانی کارترز محسوب می‌گردد.",
    },
    {
      img: "carter",
      title: "شرکت خرده‌فروشی آمریکایی است، که در سال ۱۸۶۵ تأسیس شد.",
    },
    {
      img: "reebok",
      title: "ولیدکننده کفش‌های ورزشی، پوشاک و لوازم ورزشی می‌باشد.",
    },
    { 
      img: "gap", title: "شرکت تولیدکننده لباس و کیف و کفش آمریکایی است" 
    },
    {
      img:"pop",
      title:"اسباب بازی سازی"
    }
  ];
  return (
    <div className="latest-product-container">
      <div className="companys margin-couple">
        <div className="companys-title">
          <h2> برند های معروف</h2>
        </div>
        <div className="companys-logo">
          <div className="d-flex comp-contain">
          <Brandtems data={info}/>
          </div>
        </div>
      </div>
    </div>
  );
}
